---
title: MechanicalFailures
classe: Autodesk.Revit.DB.BuiltInFailures+MechanicalFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# MechanicalFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId InitialEqualFrictionSizingFailed { get; }` | `MechanicalFailures.InitialEqualFrictionSizingFailed` | FailureDefinitionId |
| `FailureDefinitionId LiningThicknessIsLargeForDiameter { get; }` | `MechanicalFailures.LiningThicknessIsLargeForDiameter` | FailureDefinitionId |
| `FailureDefinitionId LiningThicknessIsLargeForHeight { get; }` | `MechanicalFailures.LiningThicknessIsLargeForHeight` | FailureDefinitionId |
| `FailureDefinitionId LiningThicknessIsLargeForWidth { get; }` | `MechanicalFailures.LiningThicknessIsLargeForWidth` | FailureDefinitionId |
| `FailureDefinitionId PanelDoesntMatchCircuitProperties { get; }` | `MechanicalFailures.PanelDoesntMatchCircuitProperties` | FailureDefinitionId |
| `FailureDefinitionId PanelValidateConfigurationError { get; }` | `MechanicalFailures.PanelValidateConfigurationError` | FailureDefinitionId |
| `FailureDefinitionId TwoPointsSelectedBeforeEdit { get; }` | `MechanicalFailures.TwoPointsSelectedBeforeEdit` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```